## 4. 분석 문법

In [3]:
import pandas as pd
df1 = pd.read_csv('sales_data.csv',encoding='utf-8-sig')
df1

,CustomerID,Name,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00
1,1002,Bob,Male,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00
2,1003,Charlie,Male,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00
3,1004,Daisy,Female,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00
4,1005,Ethan,Male,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00

In [26]:
display(df1.head(1),
        df1.tail(1))
df1.shape

,CustomerID,Name,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00

,CustomerID,Name,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate
4,1005,Ethan,Male,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00

(5, 10)

In [28]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CustomerID    5 non-null      int64
 1   Name          5 non-null      object
 2   Gender        5 non-null      object
 3   Age           5 non-null      int64
 4   Country       5 non-null      object
 5   Product       5 non-null      object
 6   Category      5 non-null      object
 7   Price         4 non-null      float64
 8   Quantity      5 non-null      int64
 9   PurchaseDate  5 non-null      object
dtypes: float64(1), int64(3), object(6)
memory usage: 532.0+ bytes

In [38]:
display(df1.columns,
        df1.index)

Index(['CustomerID', 'Name', 'Gender', 'Age', 'Country', 'Product', 'Category',
       'Price', 'Quantity', 'PurchaseDate'],
      dtype='object')

RangeIndex(start=0, stop=5, step=1)

In [40]:
df1.describe()

        CustomerID        Age       Price  Quantity
count     5.000000   5.000000    4.000000  5.000000
mean   1003.000000  28.000000  545.000000  1.200000
std       1.581139   4.949747  253.179778  0.447214
min    1001.000000  22.000000  300.000000  1.000000
25%    1002.000000  25.000000  435.000000  1.000000
50%    1003.000000  28.000000  490.000000  1.000000
75%    1004.000000  30.000000  600.000000  1.000000
max    1005.000000  35.000000  900.000000  2.000000

In [62]:
## enumerate는 리스트를 돌면서 인덱스 값과 해당 요소값을 같이 반환

list=df1['Name'].tolist()
display(list)
for index,location in enumerate(list):
    print(index+1,location)

['Alice', 'Bob', 'Charlie', 'Daisy', 'Ethan']

1 Alice
2 Bob
3 Charlie
4 Daisy
5 Ethan

In [66]:
## 열간의 상관관계 
df1.corr(numeric_only=True)

              CustomerID       Age     Price      Quantity
CustomerID  1.000000e+00  0.574989 -0.520110  3.925231e-17
Age         5.749889e-01  1.000000  0.464567 -6.776309e-01
Price      -5.201104e-01  0.464567  1.000000 -1.711564e-01
Quantity    3.925231e-17 -0.677631 -0.171156  1.000000e+00

In [96]:
# 특정 열에 포함되어있는 값의 종류
display(df1['Gender'].unique())

# 특정 열에 포함되어있는 값의 개수
display(df1['Gender'].nunique())

# 데이터 열의 사이즈를 보여준다 5개의 값으로 이뤄짐
display(df1['Gender'].count())

# 특정 열에 포함되어 있는 값의 종류별 개수
# normalize=True 는 비율로 표시
display(df1['Gender'].value_counts(normalize=True))

# 숫자형 변수를 구간으로 분리  bins=2 두개의 구간으로 나눔
display(df1['Age'].value_counts(bins=2))

array(['Female', 'Male'], dtype=object)

2

5

Gender
Male      0.6
Female    0.4
Name: proportion, dtype: float64

(21.985999999999997, 28.5]    3
(28.5, 35.0]                  2
Name: count, dtype: int64

### pivot_table(),crosstab(),groupby()

In [108]:
# 두개의 열의 조합 
조합=df1[['Quantity','Gender']].value_counts()
조합

Quantity  Gender
1         Female    2
          Male      2
2         Male      1
Name: count, dtype: int64

In [132]:
display(조합.sort_index().to_frame())

# 피벗테이블이란?
#👉 “행과 열 기준으로 데이터를 다시 정리하고, 원하는 값들을 요약해서 보여주는 표
# 통계적 요약,수치계산에 유용함 
display(조합.sort_index().to_frame().unstack())

                 count
Quantity Gender
1        Female      2
         Male        2
2        Male        1

          count
Gender   Female Male
Quantity
1           2.0  2.0
2           NaN  1.0

In [41]:
df1.pivot_table(index='Quantity', columns='Gender', values='CustomerID', aggfunc='count') ## agg_fun='mean'이 기본값
#  fill_value=None  nan을  대체
#  dropna=True      nan을 제거

Gender    Female  Male
Quantity
1            2.0   2.0
2            NaN   1.0

In [49]:
# 크로스탭이란?
# 단순 빈도표,교차표 만들기에 유용함

pd.crosstab(index=df1['Quantity'],columns=df1['Gender'])

Gender    Female  Male
Quantity
1              2     2
2              0     1

In [53]:
## null값은 개수로 치지 않음
df1['Price'].size

5

In [141]:
df1.groupby(['Gender'])['Quantity'].sum()

Gender
Female    2
Male      4
Name: Quantity, dtype: int64

In [61]:
df1.groupby(['Gender','Quantity'])[['Age']].count()

                 Age
Gender Quantity
Female 1           2
Male   1           2
       2           1

In [67]:
df1.groupby(['Gender','Quantity']).size().to_frame()

                 0
Gender Quantity
Female 1         2
Male   1         2
       2         1

### 컬럼의 선택 /수정 /삭제 /결측

In [70]:
df1

,CustomerID,Name,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00
1,1002,Bob,Male,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00
2,1003,Charlie,Male,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00
3,1004,Daisy,Female,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00
4,1005,Ethan,Male,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00

In [74]:
df1[['Name','Gender']]

      Name  Gender
0    Alice  Female
1      Bob    Male
2  Charlie    Male
3    Daisy  Female
4    Ethan    Male

In [82]:
df1[df1['Name']=='Bob']

,CustomerID,Name,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate
1,1002,Bob,Male,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00

In [90]:
df1.isnull().sum()

CustomerID      0
Name            0
Gender          0
Age             0
Country         0
Product         0
Category        0
Price           1
Quantity        0
PurchaseDate    0
dtype: int64

In [108]:
display(df1.dropna()) # 결측치 있는 모든 행 삭제
display(df1.dropna(subset=['Price'])) # subset 열에 존재하는 결측치가 포함된 행만 삭제
display(df1.drop(df1[df1['Price']<500].index))  # 조건에 맞게 삭제하기

,CustomerID,Name,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00
1,1002,Bob,Male,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00
2,1003,Charlie,Male,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00
3,1004,Daisy,Female,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00

,CustomerID,Name,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00
1,1002,Bob,Male,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00
2,1003,Charlie,Male,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00
3,1004,Daisy,Female,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00

,CustomerID,Name,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00
1,1002,Bob,Male,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00
4,1005,Ethan,Male,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00

In [ ]:
df1.fillna(1200) # 결측치를 1200으로 대체

### np.where / query()

- np.where(조건, 조건이 참일 때 값, 조건이 거짓일 때 값)
- query()는 조건으로 행 필터링할 때 사용

In [237]:
import numpy as np
df1['가격 측정']= np.where(df1['Price']<500,'싸다','비싸다')

In [239]:
df1.head(1)

,CustomerID,Name,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate,가격 측정
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00,비싸다

In [ ]:
# 다단계 분류 
df1['PriceLabel'] = np.where(df1['Price'] < 300, '매우저가',
                      np.where(df1['Price'] < 500, '저가',
                        np.where(df1['Price'] < 800, '중가', '고가')))

In [133]:
df1.query("Price<500 and Gender == 'Male'") ## 범주형변수는 '  '  로 묶어줘야함

,CustomerID,Name,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate,가격 측정
2,1003,Charlie,Male,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00,싸다

In [241]:
# 칼럼명 변경하기 

df1.rename(columns={'Name':'이름'})

,CustomerID,이름,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate,가격 측정
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00,비싸다
1,1002,Bob,Male,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00,비싸다
2,1003,Charlie,Male,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00,싸다
3,1004,Daisy,Female,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00,싸다
4,1005,Ethan,Male,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00,비싸다

In [243]:
df1.columns=['고객ID','이름','성별','나이','국가','상품','카테고리','가격','수량','구매날짜','가격측정']

In [245]:
df1

,고객ID,이름,성별,나이,국가,상품,카테고리,가격,수량,구매날짜,가격측정
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00,비싸다
1,1002,Bob,Male,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00,비싸다
2,1003,Charlie,Male,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00,싸다
3,1004,Daisy,Female,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00,싸다
4,1005,Ethan,Male,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00,비싸다

In [163]:
# 중복행 확인하기

df1.duplicated().sum()

0

In [ ]:
df1.drop_duplicated() # 중복행 제거  # subset= ['열이름1',열이름2]  , keep='first  파라미터 사용시  중복의 첫번째만 남길수있음

## 데이터 병합

In [170]:
# 데이터 합치기
display(pd.concat([df1['이름'],df1['국가']],axis=0))
display(pd.concat([df1['이름'],df1['국가']],axis=1))

0      Alice
1        Bob
2    Charlie
3      Daisy
4      Ethan
0        USA
1         UK
2      Korea
3        USA
4     Canada
dtype: object

        이름      국가
0    Alice     USA
1      Bob      UK
2  Charlie   Korea
3    Daisy     USA
4    Ethan  Canada

In [172]:
df1

,고객ID,이름,성별,나이,국가,상품,카테고리,가격,수량,구매날짜,가격측정
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00,비싸다
1,1002,Bob,Male,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00,비싸다
2,1003,Charlie,Male,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00,싸다
3,1004,Daisy,Female,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00,싸다
4,1005,Ethan,Male,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00,비싸다

In [174]:
df1_merge1=df1[['성별','국가']]
df2_merge2=df1[['성별','가격측정']]

In [176]:
pd.merge(df1_merge1,df2_merge2,on='성별',how='inner')

        성별      국가 가격측정
0   Female     USA  비싸다
1   Female     USA   싸다
2     Male      UK  비싸다
3     Male      UK   싸다
4     Male      UK  비싸다
5     Male   Korea  비싸다
6     Male   Korea   싸다
7     Male   Korea  비싸다
8   Female     USA  비싸다
9   Female     USA   싸다
10    Male  Canada  비싸다
11    Male  Canada   싸다
12    Male  Canada  비싸다

## 5. 기타함수
### apply(),split(),lstrip(),replace(),Startwith(),map()

In [200]:
# apply는 특정 열의 행을 자동으로 돌기 때문에 for을 쓰지 않아도됨
def 할인(row):
    if row['가격측정']=='비싸다':
        return '할인필요'
    else:
        return '할인불필요'
    
# df1의 하나의 행을 할인이라는 함수에 대입하라.
df1['할인필요']=df1.apply(할인,axis=1)

In [202]:
df1

,고객ID,이름,성별,나이,국가,상품,카테고리,가격,수량,구매날짜,가격측정,할인필요
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00,비싸다,할인필요
1,1002,Bob,Male,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00,비싸다,할인필요
2,1003,Charlie,Male,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00,싸다,할인불필요
3,1004,Daisy,Female,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00,싸다,할인불필요
4,1005,Ethan,Male,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00,비싸다,할인필요

In [204]:
txt = "사과,바나나,포도"
txt.split(",")

['사과', '바나나', '포도']

In [206]:
"$$$돈많은사람".lstrip("$")

'돈많은사람'

In [208]:
"2024/06/29".replace("/", "-")

'2024-06-29'

In [220]:
df1['카테고리'].str.startswith('P')

0     True
1    False
2     True
3    False
4    False
Name: 카테고리, dtype: bool

In [247]:
# map() 어떤 값을 특정 값으로 치환하고 싶을떄
Gender_map={'Female':'여성','Male':'남성'}
df1['성별']=df1['성별'].map(Gender_map)

In [249]:
df1

,고객ID,이름,성별,나이,국가,상품,카테고리,가격,수량,구매날짜,가격측정
0,1001,Alice,여성,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00,비싸다
1,1002,Bob,남성,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00,비싸다
2,1003,Charlie,남성,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00,싸다
3,1004,Daisy,여성,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00,싸다
4,1005,Ethan,남성,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00,비싸다

### list_compression 

[표현식 for 변수 in 반복가능한객체]

In [259]:
#문제 1: 1부터 5까지의 제곱 리스트 만들기

[x**2 for x in range(1,6)]

[1, 4, 9, 16, 25]

In [263]:
#문제 2: 1부터 10까지 중 짝수만 문자열로 바꿔 리스트로

[x for x in range(1,11) if x%2 == 0]

[2, 4, 6, 8, 10]

In [265]:
#문제 3: 숫자 리스트 [3, 7, 2, 1, 9]에서 5보다 크면 'Big', 작으면 'Small'

['big' if x>5 else 'small' for x in [3,7,2,1,9]]

['small', 'big', 'small', 'small', 'big']

In [277]:
## 정렬

display(df1.sort_values(by='나이',ascending=False))

## 인덱스 정렬

df1.sort_index()

,고객ID,이름,성별,나이,국가,상품,카테고리,가격,수량,구매날짜,가격측정
4,1005,Ethan,남성,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00,비싸다
1,1002,Bob,남성,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00,비싸다
3,1004,Daisy,여성,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00,싸다
0,1001,Alice,여성,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00,비싸다
2,1003,Charlie,남성,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00,싸다

,고객ID,이름,성별,나이,국가,상품,카테고리,가격,수량,구매날짜,가격측정
0,1001,Alice,여성,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00,비싸다
1,1002,Bob,남성,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00,비싸다
2,1003,Charlie,남성,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00,싸다
3,1004,Daisy,여성,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00,싸다
4,1005,Ethan,남성,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00,비싸다

In [285]:
#리스트 정렬
list1=[3, 7, 2, 1, 9]
list1.sort() # key 파라미터 사용시 조건에 맞춰 정렬가능 
list1

[1, 2, 3, 7, 9]

## lamda 함수
### lambda 매개변수: 표현식

In [292]:
add= lambda a,b : a+b
add(3,5)

8

In [296]:
홀짝= lambda x: '짝수' if x%2==0 else '홀수'
홀짝(3)

'홀수'

In [ ]:
# apply와 함꼐 결합
df['카테고리'] = df['가격'].apply(lambda x: '고가' if x > 1000 else '저가')

## qcut,cut,agg